[
  {
    "id": 100,
    "name": "Anadama Bread",
    "type": "cook",
    "category": "Bread",
    "ingredients": [
      "½ cup water",
      "¼ cup cornmeal",
      "2 tablespoons butter",
      "½ cup molasses",
      "1 (.25 ounce) package active dry yeast",
      "½ cup warm water (110 degrees F)",
      "3 cups all-purpose flour, divided",
      "1 teaspoon salt"
    ],
    "instructions": [
      "Place 1/2 cup water and cornmeal in a small saucepan. Bring to a boil over medium heat, stirring occasionally. Cook until mixture thickens; about 5 minutes. Remove from heat and stir in the butter or margarine and molasses. Let cool to lukewarm.",
      "In a small mixing bowl, dissolve yeast in 1/2 cup warm water. Let sit until creamy; about 10 minutes.",
      "In a large mixing bowl, combine the cooled cornmeal mixture with the yeast mixture; stir until well blended. Add 2 cups of the flour and the salt; mix well. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
      "Lightly oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and put in a warm place to rise until doubled in volume, about 1 hour.",
      "Preheat oven to 375 degrees F (190 degrees C).",
      "Deflate the dough and turn it out onto a lightly floured surface and form into a loaf. Place the loaf in a lightly greased 9x5 inch loaf pan. Cover with a damp cloth and let rise until doubled in volume, about 40 minutes.",
      "Bake in preheated oven for about 30 minutes, or until the top is golden brown and the bottom of the loaf sounds hollow when tapped."
    ]
  },
  {
    "id": 101,
    "name": "Argentinian empanadas dough",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "3 cups all-purpose flour",
      "½ teaspoon salt",
      "¾ cup vegetable oil",
      "½ cup cold water"
    ],
    "instructions": [
      "Preheat oven to 400F.",
      "To make dough: Combine the flour with the salt in a large bowl. Add the oil and the water and knead until dough forms. If the dough requires, add more water. Cover and refrigerate for 10 minutes.",
      "Form the empanada dough mix into ping-pong-sized balls. Flatten each ball with a rolling pun.",
      "When making empanadas, layer 1 TB of mixture per empanada and top with a sprinkle of cheese. Seal empanada and set aside. Repeat with remaining filling and dough.",
      "When ready to bake, arrange empanadas on parchment-lined baking sheets. Brush tops with egg wash, and sprinkle sesame seeds (optional). Bake at 400F until golden brown, rotating sheets halfway through, 30 to 40 minutes.",
      "For onion and cheese vegetarian empanadas:",
      "2 onions sliced into crescents",
      "1 cup Gouda cheese shredded",
      "1 tablespoon oregano",
      "Salt & pepper to taste",
      "preheat a large pan to medium heat. Add 2 TBs grapeseed oil. Sautee onion until it turns golden, 10 minutes. Remove from heat and season with oregano, salt & pepper. Set aside"
    ]
  },
  {
    "id": 102,
    "name": "Armenian Apricot Red Lentil Soup",
    "type": "cook",
    "category": "Soup",
    "ingredients": [
      "▢1 cup dried apricots , roughly chopped; or 2 large, ripe apricots, pitted and roughly chopped, plus more to serve",
      "▢2 tablespoons extra virgin olive oil, plus more to serve",
      "▢1 small yellow onion, finely chopped",
      "▢3 large carrots, peeled and finely chopped",
      "▢Kosher salt",
      "▢Freshly ground black pepper",
      "▢1 cup grape tomatoes, halved (about 14 tomatoes)",
      "▢2 tablespoons tomato paste",
      "▢2 medium garlic cloves, crushed",
      "▢1 teaspoon ground cumin",
      "▢1/2 teaspoon sweet paprika",
      "▢2 tablespoons water",
      "▢5 cups chicken stock, homemade or store-bought, or vegetable broth, plus more if needed",
      "▢2 cups red lentils rinsed and drained",
      "▢1 lemon, juiced (about 1/4 cup)",
      "▢1/4 cup roughly chopped fresh flat-leaf parsley"
    ],
    "instructions": [
      "Prep the apricots. In a small bowl, add the chopped dried apricots and cover with warm water by about 1 inch. Set aside to plump and soften while you work on the rest of the soup. (If using fresh apricots, skip this step.)",
      "Sauté the vegetables. In a large Dutch oven or heavy-bottomed pot set over medium-high heat, add the olive oil. Once the oil begins to shimmer, add the onion and carrots and season with a big pinch of salt and black pepper (about 1/2 teaspoon each). Cook, stirring occasionally, until the vegetables are soft, about 8 minutes.",
      "Add the tomatoes and spices. Add the grape tomatoes, tomato paste, garlic, cumin, paprika, and the water. Mix and cook for 1 more minute.",
      "Simmer the soup. Stir in the stock and the lentils. Season with another big pinch of salt and black pepper (about 1/2 teaspoon each). Bring the liquid to a boil, then reduce the heat to low and partially cover the pot. Simmer for about 20 minutes, or until the lentils are very tender and begin to break down; stir the soup occasionally. If it gets too thick, stir in about 1/2 cup stock or more water to reach your desired thickness; I like mine on the thicker side—more like stew.",
      "Purée the soup. Remove the pot from the heat. Drain the chopped apricots and stir them into the soup along with the lemon juice. Using an immersion blender, carefully puree the soup to your desired smoothness. (I like mine with a little bit of texture, but some people prefer it smooth. It’s really up to you.) Taste and adjust the salt to your liking.",
      "Finish and serve. Ladle the soup into serving bowls and finish each with a generous drizzle of olive oil and a sprinkle of fresh parsley. Add some additional chopped apricots, either fresh or dried, if you like."
    ]
  },
  {
    "id": 103,
    "name": "Buttery Gruyère Cheese Crackers",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "▢ 6 ounces gruyere cheese",
      "▢ 4 tablespoons butter (room temp)",
      "▢ ½ cup flour",
      "▢ 2 teaspoons rosemary (minced)",
      "▢ ¼ teaspoon salt",
      "▢ coarse salt"
    ],
    "instructions": [
      "Grate the cheese in a food processor. Add the butter and process to combine. Add the flour, rosemary and ¼ teaspoon of salt. Pulse until clumps form.",
      "Place the dough on some plastic wrap and form it into a 9 inch square. Refrigerate for at least 20 minutes.",
      "Preheat oven to 350º and line a cookie sheet with parchment paper.",
      "Place dough on a lightly floured surface and roll to ⅛ inch thickness. Using a pizza cutter or a fluted pastry wheel, cut into 1 inch diamonds. With a knife or skewer, make a hole in the center of each cracker.",
      "With your fingers, dab some water onto each cracker and then sprinkle with coarse salt.",
      "Bake for 10-12 minutes until lightly browned. Allow to cool on a rack."
    ]
  },
  {
    "id": 104,
    "name": "Cabbage & White Bean Soup",
    "type": "cook",
    "category": "Soup",
    "ingredients": [
      "2 tablespoons extra-virgin olive oil",
      "4 cups chopped green cabbage",
      "1 ½ cups sliced leek",
      "1 ½ tablespoons finely chopped garlic",
      "4 cups lower-sodium vegetable broth",
      "½ teaspoon salt",
      "1 (15 ounce) can no-salt-added white beans, rinsed",
      "1 Parmesan rind (optional)",
      "1 tablespoon white-wine vinegar",
      "¼ cup pesto",
      "--- Local Offers ---"
    ],
    "instructions": [
      "Heat oil in a large Dutch oven or large pot over medium-high heat. Add cabbage and leek; cook, stirring often, until softened but not browned, about 4 minutes. Add garlic; cook, stirring constantly, until fragrant, about 1 minute. Add broth, salt, beans and Parmesan rind, if using; increase heat to high and bring to a boil.",
      "Reduce heat to low to maintain a low simmer; cover and cook, undisturbed, until the cabbage is tender, about 10 minutes. Remove from heat and stir in vinegar. Remove and discard Parmesan rind, if using. Divide the soup among 4 bowls, and top with pesto."
    ]
  },
  {
    "id": 105,
    "name": "Chicken Meatball Orzo Soup",
    "type": "cook",
    "category": "Soup",
    "ingredients": [
      "--- chicken meatballs ---",
      "1 pound lean ground chicken, I like to use 94% lean",
      "kosher salt and pepper",
      "2 garlic cloves, minced",
      "½ cup finely grated parmesan",
      "½ cup seasoned breadcrumbs",
      "⅓ cup chopped fresh herbs, like parsley, basil and chives",
      "1 tablespoon olive oil",
      "--- soup ---",
      "3 tablespoons unsalted butter",
      "1 sweet onion, diced",
      "2 carrots, finely grated",
      "2 celery sticks, diced",
      "3 garlic cloves, minced",
      "kosher salt and pepper",
      "½ teaspoon poultry seasoning",
      "7 to 8 cups chicken stock",
      "1 parmesan cheese rind",
      "1 cup uncooked orzo pasta",
      "lemon wedges, for spritzing",
      "fresh parsley, for topping"
    ],
    "instructions": [
      "Place the chicken in a large bowl. Season all over with salt and pepper. Add the garlic, parmesan, breadcrumbs and herbs. Mix gently until just combined. Roll the mixture into 1-inch meatballs.",
      "Heat the olive oil in a large stock pot over medium heat. Add the meatballs in a single layer and brown for 3 to 4 minutes. Flip gently and brown the other side for another 3 to 4 minutes. Shake the pan, tossing the meatballs around. Transfer them to a plate to start the soup in the same pot!",
      "Add the butter to the pot, along with the onions, carrots, celery, garlic and a big pinch of salt and pepper. Cook until softened, about 6 to 8 minutes. Add in 7 cups of chicken stock and the parmesan rind. Add in the meatballs. Bring the mixture to a boil, then reduce it to a simmer. If you have the time, you can cover it and simmer for 10 to 20 minutes to develop the flavor more. If not, move to the orzo step!",
      "Stir in the orzo pasta. Cook uncovered, stirring occasionally, until the pasta is al dente, about 8 minutes.",
      "Add a spritz of lemon to the pot and stir. Serve the soup topped with fresh parsley.",
      "Note: if you want to make this ahead of time for meal prep, cook the orzo separately according to package directions. Store it separately in the fridge. Combine orzo and soup in a pot when heating! There will be more broth this way, but it’s still delicious."
    ]
  },
  {
    "id": 106,
    "name": "Chinese Sesame Flatbread",
    "type": "cook",
    "category": "Bread",
    "ingredients": [
      "--- Dough ---",
      "▢ 200 g all purpose flour plus more for dusting, 1 ⅔ cup",
      "▢ ½ teaspoon sea salt",
      "▢ 1 tablespoon sugar",
      "▢ 50 g hot water (around 195°F, 90°C), ¼ cup",
      "▢ ¼ teaspoon instant yeast",
      "▢ 70 g cold water, ⅓ cup",
      "▢ 1 tablespoon vegetable oil plus more for greasing",
      "--- Oil paste ---",
      "▢ 35 g vegetable oil, 2 ½tbsp",
      "▢ 50 g cake flour, ⅓ cup",
      "--- Topping ---",
      "▢ 4 tablespoon toasted white sesame seeds",
      "▢ 1-2 teaspoon black sesame seeds, optional"
    ],
    "instructions": [
      "Making the dough",
      "Mix flour, salt and sugar together in a mixing bowl before adding in hot water. Stir and mix with chopsticks/fork until it becomes lumpy.",
      "Add yeast, cold water and oil; stir with chopsticks/fork until the liquid is all absorbed by the flour, and then knead until a dough is form. The dough will be very sticky, so just knead until you're able to form a rough ball. Grease the dough with oil and cover with plastic wrap before allowing it to rest for 20 - 30 minutes so that it'd be easier to roll out later.",
      "Making the oil paste",
      "Meanwhile, heat the oil in a small pan on medium heat until it's hot. Add in the cake flour and stir until smooth. Continue to cook and stir until it darkens a bit and becomes aromatic. Pour the paste in a bowl and let it cool down.",
      "Preheat the oven to 425°F (220°C)",
      "Forming the bread",
      "Dust the working surface with a thin layer of flour, roll the dough out to an approximately 10\" x 16\" rectangle.",
      "Spread the oil paste by spatula or by hand on the dough, leaving ½ inch on the top.",
      "Roll the dough from the bottom all the way up, pinching the seam at the end to close.",
      "Cut the roll into 6 even pieces and gently press each piece down to flatten a bit and bring the two \"cut\" sides to the middle and pinch them together (it's ok if they don't stay together perfectly).",
      "Gently roll each piece out to an oval shape and then fold the top third of the dough down and the bottom third up. After finishing all six pieces, repeat this step again for each piece. Always fold the side with oil paste in so that we'd end up with a smooth surface. Cover and let rest for 10 minutes.",
      "Put sesame seeds in a small plate and lightly press the smooth side of each piece of dough into the plate of sesame seeds.",
      "Baking",
      "Roll each piece out to about a 3\" x 6\" rectangle. Place the pieces on a lined baking sheet and bake for 12 minutes or until the top is golden brown.",
      "If you are storing these for later, simply toast them in a toaster oven for 3 -5 minutes and they will be just as good as when they're fresh.",
      "If you want to stuff things inside, simply cut the side with a pair of scissors and open it like a book."
    ]
  },
  {
    "id": 107,
    "name": "Chocolate Honey Crunch Pecan Pie",
    "type": "cook",
    "category": "Dessert",
    "ingredients": [
      "4 eggs, slightly beaten",
      "1 cup light-colored corn syrup",
      "1/4 cup granulated sugar",
      "1/4 cup packed brown sugar",
      "2 envelopes (1 oz. each) premelted unsweetened chocolate product (*)",
      "2 tablespoons butter, melted",
      "1 tablespoon bourbon",
      "1 teaspoon vanilla",
      "1/2 teaspoon salt",
      "1 cup chopped pecans",
      "1/2 cup semisweet chocolate pieces",
      "1 9-inch unbaked pastry shell*",
      "Honey-Pecan Topping (see recipe below)"
    ],
    "instructions": [
      "For filling, in a large mixing bowl, combine eggs, corn syrup, granulated sugar, brown sugar, unsweetened chocolate product, melted butter, bourbon, vanilla, and salt. Mix well. Stir in chopped pecans and chocolate pieces.",
      "Pour the filling into the pastry shell. Bake in a 350 degree F oven for 40 minutes; remove from oven. Carefully spoon Honey-Pecan Topping evenly over pie. Return to oven and bake about 10 minutes more or until topping is bubbly.",
      "Honey-Pecan Topping: In a small saucepan, combine 1/3 cup packed brown sugar, 3 tablespoons butter, and 3 tablespoons honey. Bring to boiling, stirring constantly; reduce heat. Boil gently, uncovered, for 2 minutes, stirring occasionally. Remove from heat. Stir in 1 cup pecan halves. Makes 10 servings.",
      "4 *Test Kitchen Tip: For the pastry shell, prepare your favorite piecrust recipe or use 1 folded refrigerated unbaked piecrust (1/2 of a 15-ounce package) or one 9-inch frozen unbaked deep-dish pastry shell. (Be sure to purchase a deep-dish pastry shell; there is too much filling for a shallow frozen pastry shell.",
      "(*)"
    ]
  },
  {
    "id": 108,
    "name": "Coffee Almond Parfait",
    "type": "cook",
    "category": "Dessert",
    "ingredients": [
      "2 egg whites",
      "2.5 -3 tsp instant coffee",
      "2 cups blanched almond cut into pieces (I buy them blanched and cut already)",
      "12 Tbs sugar ( = 3/4 cup)",
      "2 cups heavy cream"
    ],
    "instructions": [
      "Roast the almond pieces in a pan until lightly golden. Take off heat and let cool.",
      "Whip the egg whites with a third of the sugar (4 Tbs = 1/4 cup), and the instant coffee.",
      "In a separate bowl, whip the heavy cream with the rest of the sugar.",
      "Fold together both mixtures as well as the almonds.",
      "Pour into a pan or individual dishes, and freeze."
    ]
  },
  {
    "id": 109,
    "name": "Cornbread with manchego cheese and chorizo recipe",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "Metric",
      "1 tsp vegetable oil",
      "100 g cured chorizo (whether hot or mild is up to you), cut into small diced pieces",
      "100 g unsalted butter",
      "150 g coarse cornmeal",
      "75 g plain flour",
      "10 g fine sea salt",
      "2 tsp baking powder",
      "25 g maple syrup",
      "40 g full-fat milk",
      "100 g buttermilk",
      "2 medium eggs",
      "100 g manchego cheese, grated"
    ],
    "instructions": [
      "Preheat the oven to 200°C/392°F/gas mark 6 and put in a skillet to heat up.",
      "Heat a little vegetable oil in a pan and fry the chorizo briefly until just coloured then lift out, drain on kitchen paper and keep to one side. If you like, you can keep the oil, which will be flavoured by the chorizo, to glaze the cornbread when it comes out of the oven.",
      "Melt the butter in a small pan then remove from the heat.",
      "Combine the cornmeal, flour, salt and baking powder in a mixing bowl.",
      "Lightly whisk in the maple syrup, milk, buttermilk, two-thirds of the melted butter and the eggs – you want the mixing to be as brief as possible – to form a thick batter. Fold in the grated cheese and fried chorizo.",
      "Remove the skillet from the oven and brush the inside all over with the rest of the melted butter.",
      "Pour in the batter and put into the oven. Turn the temperature down to 190°C/375°F/gas mark 5 and bake for 10 minutes, then turn the temperature down again to 180°C/356°F/gas mark 4 for a further 20 minutes.",
      "To check that the cornbread is ready, insert a skewer or the point of a small sharp knife into the centre. It should come out clean.",
      "If you wish, glaze the top by brushing it with a little of the reserved chorizo oil.",
      "Serve the cornbread warm from the skillet so everyone can break off a piece."
    ]
  },
  {
    "id": 110,
    "name": "Cream Cheese Chicken",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "1 small yellow onion",
      "4 cloves garlic",
      "1 small bunch fresh dill",
      "8 ounces cream cheese",
      "4 boneless, skinless chicken breasts (about 2 pounds total)",
      "1 1/2 teaspoons kosher salt, divided, plus more as needed",
      "3/4 teaspoon freshly ground black pepper, divided, plus more as needed",
      "4 tablespoons olive oil, divided",
      "1/2 cup dry white wine",
      "1 1/2 cups low-sodium chicken broth",
      "2 teaspoons Dijon mustard",
      "1/4 teaspoon red pepper flakes"
    ],
    "instructions": [
      "Finely chop 1 small yellow onion and peel and mince 4 garlic cloves. Pick the fronds from the 1 small bunch fresh dill and coarsely chop until you have 2 tablespoons. Cut 8 ounces cream cheese into 8 pieces. Pat 4 boneless, skinless chicken breasts dry with paper towels. Season all over with 1 teaspoon of the kosher salt and 1/2 teaspoon of the black pepper.",
      "Heat 2 tablespoons olive oil in a large skillet over medium-high heat until shimmering. Add the chicken and cook, flipping halfway through, until golden on both sides, about 10 minutes total. Transfer the chicken to a plate (it will not be cooked through).",
      "Add the remaining 2 tablespoons olive oil to the pan and heat until shimmering. Add the onion and cook, stirring occasionally, until tender, about 2 minutes. Add the garlic, and cook, stirring, until fragrant and golden-brown, about 1 minute more. Pour in 1/2 cup dry white wine and simmer, scraping up any browned bits from the bottom of the pan, until almost evaporated, about 1 minute.",
      "Pour in 1 1/2 cups low-sodium chicken broth. Add the cream cheese, 2 teaspoons Dijon mustard, the remaining 1/2 teaspoon kosher salt, and remaining 1/4 teaspoon black pepper. Bring to a simmer, whisking frequently, until the cream cheese is melted and combined. Taste and season with more kosher salt and black pepper as needed.",
      "Return the chicken and any accumulated juices to the pan. Bring back to a simmer. Cover and reduce the heat to medium. Simmer until the chicken is cooked through, 3 to 5 minutes more. Remove from the heat and sprinkle with the dill and 1/4 teaspoon red pepper flakes."
    ]
  },
  {
    "id": 111,
    "name": "Crispy Pineapple Pork Shoulder",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "--- Pork shoulder ---",
      "Neutral oil",
      "One 6-8 pound bone-in skin-on pork shoulder (ask your butcher if your grocery store doesn't offer this normally)",
      "Salt",
      "--- Chunky pineapple sauce ---",
      "1 pineapple, peeled, cored, and sliced into 1 inch rings",
      "1 tablespoon Shabazi N.38 blend",
      "1 tablespoon apple cider vinegar",
      "2 tablespoons dark rum",
      "Brown sugar, to taste (this will depend on the sweetness of the pineapple, figure 1-4 teaspoons)",
      "2 teaspoons soy sauce"
    ],
    "instructions": [
      "Preheat your oven to 200°F.",
      "Place a sheet of aluminum foil on the bottom of your baking pan to catch any drips, place the wire rack on top of this and grease it lightly with an oiled paper towel.",
      "Score the shoulder with a sharp knife or scalpel in a diamond pattern, cutting through the skin but not all the way through the fat into the meat (this step is the key to this recipe, without scoring the skin the crisping process takes too long; the skin burns before it gets nicely crisp). Rub the roast all over with a light coating of salt and then place it skin side up on the center of the rack. Place the pineapple slices on foil sheets (a few slices in each packet, however many you can fit), sprinkle with Shabazi N.38, and wrap them tightly. Arrange these foil packets around the pork shoulder.",
      "Cook for about 8-9 hours (so you can either start it in the morning, or cook it overnight and then hold until dinnertime). To hold, allow the roast to cool until you can handle it, then wrap in foil and place the foil wrapped roast in a small ice chest and wait until the evening. It will easily hold for 5-6 hours.",
      "Drain the fat from the aluminum foil (discarding or reserving for another use), then tear the dripping coated foil into small pieces and place in a saucepan with 2 cups of water. Bring to a boil and scrape the foil gently to dissolve all of the pan drippings and make a thin broth, then remove and discard the foil. Carefully unwrap the pineapple, adding the juices to the pot, and slice the rings into small pieces. Reduce the broth by 1/3 then add the chopped pineapple to the pot along with cider vinegar, dark rum, brown sugar, and soy sauce. Hold until you are ready to serve the roast. If you're serving the roast later you can chill the sauce and reheat.",
      "To finish: Preheat the oven to 475°F. Place a fresh sheet of aluminum foil on your baking sheet and the rack on top of that (clean the rack first if it's particularly dirty). Place the roast skin side up in the center of the rack and cook until the skin is puffy and crispy (generally 20-25 minutes depending on your oven's actual temperature). Check frequently to make sure the skin does not burn (a spot or two is fine). Warm the sauce and remove the roast to a cutting board.",
      "Serve with the roasted pineapple sauce on the side and make sure to eat the skin first while it is still crisp and airy. All you need is a fork to pull the meat apart, it'll be that tender. The meat is great in lettuce cups or in warm flour tortillas (if you want to use everything try using the reserved fat from roasting to make your tortillas)."
    ]
  },
  {
    "id": 112,
    "name": "Curried Sweet Potato & Peanut Soup",
    "type": "cook",
    "category": "Soup",
    "ingredients": [
      "2 tablespoons neutral oil, such as canola or avocado",
      "1 ½ cups diced yellow onion",
      "1 tablespoon minced garlic",
      "1 tablespoon minced fresh ginger",
      "4 teaspoons red curry paste (see Tip)",
      "1 serrano chile, ribs and seeds removed, minced",
      "1 pound sweet potatoes, peeled and cubed (1/2-inch pieces)",
      "3 cups water",
      "1 cup \"lite\" coconut milk",
      "¾ cup unsalted dry-roasted peanuts",
      "1 (15 ounce) can white beans, rinsed",
      "¾ teaspoon salt",
      "¼ teaspoon ground pepper",
      "¼ cup chopped fresh cilantro",
      "2 tablespoons lime juice",
      "¼ cup unsalted roasted pumpkin seeds",
      "Lime wedges"
    ],
    "instructions": [
      "Heat oil in a large pot over medium-high heat. Add onion and cook, stirring often, until softened and translucent, about 4 minutes.",
      "Stir in garlic, ginger, curry paste, and serrano; cook, stirring, for 1 minute. Stir in sweet potatoes and water; bring to a boil. Reduce heat to medium-low and simmer, partially covered, until the sweet potatoes are soft, 10 to 12 minutes.",
      "Transfer half of the soup to a blender, along with coconut milk and peanuts; puree. (Use caution when pureeing hot liquids.) Return to the pot with the remaining soup. Stir in beans, salt, and pepper; heat through. Remove from the heat. Stir in cilantro and lime juice. Serve with pumpkin seeds and lime wedges."
    ]
  },
  {
    "id": 113,
    "name": "Dates and Coconut (Er_ela)",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "12 Graham Crackers (200 gr) broken into small pieces",
      "2 sticks of butter (200 gr)",
      "200 gr pitted compressed dates",
      "100 gr, walnuts, chopped",
      "½ cup sugar",
      "Unsweetened coconut flakes (small)",
      "Cover the chopped dates with milk. Boil and strain well."
    ],
    "instructions": [
      "Return the dates to the saucepan. Add the butter, sugar and walnuts. Simmer while stirring until mixed together. Add Graham Crackers.",
      "Cover the bottom of a shallow dish with coconut flakes. Pour the dates and cookies mixture on top and cover with another layer of coconut flakes. Press down and chill well before serving."
    ]
  },
  {
    "id": 114,
    "name": "Dates and walnuts cake",
    "type": "cook",
    "category": "Dessert",
    "ingredients": [
      "1 ¼ cups sifted all-purpose flour",
      "½ teaspoon baking powder",
      "½ teaspoon baking soda",
      "¼ teaspoon salt",
      "1 cup dates, pitted and chopped",
      "1 cup unsalted butter, softened",
      "1 cup white sugar",
      "1 cup packed brown sugar",
      "3 large eggs",
      "1 cup chopped walnuts"
    ],
    "instructions": [
      "Preheat the oven to 350 degrees F (180 degrees C). Grease a 9x13-inch baking pan and line with parchment paper.",
      "Whisk flour, baking powder, baking soda, and salt together in a bowl. Transfer 1/2 cup to a smaller bowl; add dates and toss to coat.",
      "Cream butter, white sugar, and brown sugar in a large bowl with an electric mixer until light and fluffy. Add eggs, one at a time, beating well after each addition. Gradually stir in flour mixture, then stir in floured dates and walnuts until well combined. Pour batter into the prepared pan.",
      "Bake in the preheated oven for 10 minutes. Reduce the heat to 300 degrees F (150 degrees C) and bake until top is dry and edges have started to pull away from the sides of the pan, 30 to 40 minutes.",
      "Cool on a wire rack for 20 minutes before cutting into 36 bars."
    ]
  },
  {
    "id": 115,
    "name": "Dense Russian Rye Bread",
    "type": "cook",
    "category": "Bread",
    "ingredients": [
      "1 1/2 cups warm water (100–110°F or 37–43°C)",
      "1 1/2 teaspoons active dry yeast",
      "2 tablespoons molasses (or dark corn syrup)",
      "2 cups bread flour",
      "1 1/2–2 1/2 cups dark rye flour (pumpernickel flour also works)",
      "1 tablespoon brown sugar",
      "1 teaspoon salt",
      "2 tablespoons melted butter",
      "2 tablespoons apple cider vinegar"
    ],
    "instructions": [
      "Activate Yeast: In a large bowl, combine the warm water, yeast, and molasses. Let the mixture sit for about 10 minutes until it becomes frothy.",
      "Combine Dry Ingredients: In a separate large bowl, whisk together the bread flour, 1 1/2 cups of the rye flour, brown sugar, salt.",
      "Mix Dough: Pour the yeast mixture, vinegar, and melted butter into the dry ingredients. Stir until a rough dough forms.",
      "Knead: Turn the dough out onto a lightly floured surface. Knead for 3-5 minutes, adding more rye flour a little at a time if the dough is too sticky to work with. The dough will be stiff but slightly sticky.",
      "First Rise: Place the kneaded dough into an oiled bowl, cover with a clean cloth or plastic wrap, and let it rise in a warm spot for about 1 hour, or until it has almost doubled in size.",
      "Shape Loaf: Punch down the dough and divide it into two equal parts (or leave as one large loaf). Roll or shape each portion into a loaf and place in a greased 9x5-inch loaf pan.",
      "Second Rise: Cover the loaf pan(s) and let the dough rise for another 30 minutes. The dough might not rise much above the pan rim during this stage.",
      "Bake: Preheat your oven to 400°F (200°C). Bake for 25-30 minutes, or until the loaf is well-browned and sounds hollow when tapped, or an instant-read thermometer registers 190°F (88°C).",
      "Cool: Remove the bread from the oven and transfer it immediately to a wire rack to cool completely before slicing. This is crucial for the texture."
    ]
  },
  {
    "id": 116,
    "name": "Easy Homemade Soft Pretzels",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "▢ 2 packages active dry yeast (4 ½ teaspoons)",
      "▢ ½ cup plus 1 teaspoon sugar",
      "▢ 1 ¾ cups warm water",
      "▢ 5 cups flour",
      "▢ 2 teaspoons salt",
      "▢ 1 tablespoon vegetable oil",
      "▢ 10 cups water",
      "▢ ½ cup baking soda",
      "▢ Coarse salt",
      "▢ ¼ cup butter (melted)"
    ],
    "instructions": [
      "Add yeast to a bowl of warm water and sprinkle a teaspoon of sugar over it. Let it sit until it gets foamy,",
      "Add flour, ½ cup of sugar, and salt to the bowl of a stand mixer. Whisk to combine. Add oil and yeast mixture and mix at medium speed with the dough hook until the dough is smooth, about 5 minutes. Remove to a bowl, lightly greased with butter. Cover and let rise in a warm place until doubled, about 1 hour.",
      "Preheat the oven to 425º. Line baking sheets with parchment paper.",
      "Add water to a Dutch oven or large pot and add baking soda. Let it come to a boil while you roll out the dough.",
      "Punch down dough to remove the air and divide it into 12 pieces. Using your hands, roll each piece into a 25-30 inch rope. It will seize up after a few rolls, let it rest until the gluten relaxes and you can roll it again.",
      "To shape into a pretzel shape, form a U and cross the strips in the middle and cross again. Take the two ends over the dough and press into the back of the pretzel shape.",
      "Add the pretzel to the boiling water for 30 seconds, remove and place on the parchment paper. Immediately add coarse salt to the top. Bake for 6-8 minutes depending on how thin you rolled the dough. It should be dark brown on the surface. Immediately brush with melted butter."
    ]
  },
  {
    "id": 117,
    "name": "Fluffy Brioche Skillet Rolls",
    "type": "cook",
    "category": "Bread",
    "ingredients": [
      "1 cup whole milk, warmed",
      "2 tablespoons honey",
      "2 ½ teaspoon active dry yeast, 1 packet",
      "4 cups all-purpose flour",
      "2 tablespoons sugar",
      "1 teaspoon kosher salt",
      "3 large eggs",
      "½ cup unsalted butter, softened and cut into pieces",
      "extra butter, for the pan",
      "1 large egg + 1 teaspoon water, lightly beaten for egg wash",
      "flaky salt, for topping"
    ],
    "instructions": [
      "Make sure the milk is warm, but not hot. You want it to be 100 degrees F.",
      "Mix the warm milk, honey and yeast together in a measuring cup or bowl. Let it sit until foamy, about 10 to 15 minutes.",
      "Use your electric mixer with a dough hook. Add the flour, sugar, salt and yeast mixture to the bowl. Add in the eggs. Mix until combined. Continue to mix and knead the dough with the dough hook until it becomes soft and sticky, about 5 minutes.",
      "After 5 minutes, add the butter pieces. Continue to mix and knead for another 5 to 10 minutes, until the butter is incorporated and the dough is soft.",
      "Transfer the dough to a greased bowl and cover it. Let it rise for 1 hour, or until it’s doubled in size.",
      "After it’s risen, punch the dough down. Divide the dough into 16 separate pieces. Form the pieces into rolls, pinching the bottom so they stay together.",
      "Rub butter all over two oven-safe skillets or one 9x13 inch dish. Place the dough pieces in the skillets (dividing them evenly) or in the baking dish. Cover and let rise for another hour.",
      "Preheat the oven to 350 degrees F. Brush the tops of the rolls with the egg wash. Bake for 20 to 25 minutes, until they are soft and fluffy. Rub the tops with butter and sprinkle with flaky salt OR sugar"
    ]
  },
  {
    "id": 118,
    "name": "German potatoes dumplings base ration",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "1 ½ pounds russet potatoes Cook until tender and let dry.",
      "salt and freshly ground black pepper to taste",
      "2 large eggs",
      "1 cup all-purpose flour"
    ],
    "instructions": []
  },
  {
    "id": 119,
    "name": "Greek stuffed peppers",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "6-8 bell peppers",
      "1 lb ground meat (i use turkey)",
      "1 cup rice (I prefer basmati)",
      "1 large onion, chopped",
      "5-6 garlic cloves, crushed",
      "5-6 Coarsely shredded carrots",
      "Can of diced tomatoes",
      "Salt, sugar, cumin, chopped parsley",
      "Olive oil",
      "1 jar Reo tomato sauce plus water to reach  half the peppers height"
    ],
    "instructions": []
  },
  {
    "id": 120,
    "name": "Kartoffelklöße",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "2 1/4 pounds Russet potatoes , high starch/low moisture potatoes will produce the most tender results (in Germany look for \"mehlig kochende\" varieties),",
      "1 large egg",
      "1 cup potato starch",
      "1 1/2 teaspoons salt",
      "1/8 teaspoon ground nutmeg"
    ],
    "instructions": [
      "Boil the potatoes whole, skins on, in lightly salted water until tender. Drain and let sit until they're cool enough to handle but still warm and then peel them. Run the potatoes through a food mill or potato ricer (two options include stainless steel or dishwasher safe hard plastic) into a large bowl. (Ricing the potatoes is imperative for achieving the right texture as mashing them will produce dense, stodgy gnocchi.)",
      "Add the potato starch, salt, egg and nutmeg to the riced potatoes. Use your hands to knead the mixture into a smooth, soft dough, being careful not to over-mix. The dough should nice and soft but not sticky. If it is, add a little more potato starch.",
      "Form the mixture into twelve 2 1/2 inch diameter balls (roughly 90 grams each, you can weigh them to get uniform sizes). (*)",
      "Bring lightly salted water to a rapid boil in a large pot (all twelve dumplings fit perfectly without overcrowding in my 11 inch diameter pot). Reduce the heat. Gently lower the dumplings on a spoon into the water, holding them for a few seconds before releasing them (this will prevent them from sticking to the bottom). Adjust the heat so that the water stays at a gentle simmer. Let the Kartoffelklösse simmer for 20 minutes, uncovered. Within a few minutes the dumplings will all rise to the top; let them continue to simmer for the full 20 minutes.",
      "Once they're done, turn off the heat. They can be kept warm in the water for up to 15 minutes while you're finishing up dinner. If you need more time they can be kept in the drained warm pot or also be transferred to a warm bowl and covered to keep the warmth in.",
      "Makes 12 potato dumplings.",
      "(*) I prefer to make two long loaves from the dough, and cut diagonally for smaller, elongated dumplings"
    ]
  },
  {
    "id": 121,
    "name": "Klößchen",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "4 1/2 pounds starchy potatoes, peeled and finely grated",
      "3 tablespoons potato starch or cornstarch, or as needed",
      "1 teaspoon salt",
      "4 tablespoons unsalted butter, divided",
      "2 large yellow onions, peeled and sliced into half-moons",
      "1 1/2 pounds slab bacon, cut into 1/2-inch strips",
      "4 large eggs"
    ],
    "instructions": [
      "Place baseball-sized portions of grated potatoes in a thin linen towel or cheesecloth. Wring out as much water as possible, transferring each strained batch into a large bowl.",
      "Alongside the strained potatoes, add starch and salt. Using clean hands, knead to form a just barely sticky dough. If potato mixture feels very wet, add a little more starch.",
      "Heat a large pot of salted water to boiling over high heat. Place a colander in a large bowl; set aside.",
      "Spread a layer of potato dough on a small cutting board, about 1/2-inch thick. Dip a soup spoon into the boiling water and, working in batches, scrape small dumplings directly from the cutting board into the boiling water, wetting the spoon with boiling water in between. Allow dumplings to boil until they float to the top, about 3 minutes. Transfer dumplings to the prepared colander using a skimmer. Repeat, boiling in batches, until the dumplings have all been boiled.",
      "Melt 2 tablespoons butter in a large skillet over medium-low heat, add 2 onions, and cook, stirring occasionally, until caramelized, about 30 minutes.",
      "Line a large plate with paper towels. Cook bacon in a small skillet over medium heat until crispy, about 10 minutes. Transfer bacon to the prepared plate with a slotted spoon.",
      "Melt remaining 2 tablespoons butter in a large nonstick skillet over medium-high heat, then add drained potato dumplings. Cook, stirring occasionally, until light golden brown, about 3 minutes. Crack eggs directly into the skillet and stir until eggs are scrambled and cooked through, 1 to 2 minutes. Season with salt."
    ]
  },
  {
    "id": 122,
    "name": "Leek, pancetta and white wine orzo",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "90g smoked pancetta, finely sliced\n2 tbsp olive oil\n 500g leeks, washed, trimmed and finely sliced\n2 garlic cloves, peeled and finely sliced\n1 large knob unsalted butter\n Sea salt and black pepper\n12g fresh thyme sprigs\n150ml white wine\n 300g orzo\n 1 litre chicken stock\n ½ lemon\n60g pecorino, finely grated\n1 handful flat-leaf parsley, finely chopped",
      "Put the pancetta and oil in a deep, wide frying pan or large saucepan, set it over a medium heat and fry for three or four minutes, until the pancetta is crisp.",
      "Add the leeks, sliced garlic and butter to the pan, season generously, then pick in the thyme leaves and cook, stirring often, for five minutes. Add the wine, turn up the heat and stir until most of the liquid evaporates.",
      "Add the orzo, stir for a few minutes until it’s all coated in the buttery leeks, then pour in the stock and bring to a boil. Turn down the heat to low, cover the pan and leave to simmer for 10 minutes, stirring once or twice. Take off the heat, squeeze in the lemon juice, then stir in most of the grated pecorino.",
      "Leave, still covered, for a minute, then serve sprinkled with the parsley, remaining pecorino and some extra grinds of black pepper."
    ],
    "instructions": []
  },
  {
    "id": 123,
    "name": "Lemon Brownies",
    "type": "cook",
    "category": "Dessert",
    "ingredients": [
      "▢ ½ cup butter (113 grams)",
      "▢ 2/3 cup chopped white chocolate* (100 grams or 3.5oz)",
      "▢ 3/4 cup granulated sugar (150 grams)",
      "▢ 2 Tablespoons lemon zest",
      "▢ 2 large eggs",
      "▢ 1 egg yolk",
      "▢ 1 Tablespoon lemon juice",
      "▢ 3/4 cup+ 1 Tablespoon all-purpose flour (100 grams)",
      "▢ 1/2 teaspoon kosher salt",
      "Glaze:",
      "▢ 1 cup powdered sugar (120 grams)",
      "▢ 1-2 Tablespoons fresh lemon juice , as needed"
    ],
    "instructions": [
      "Melt chocolate: Add 2-3 inches of water to a small saucepan over medium heat and bring to a simmer. Add butter and chopped white chocolate to a heat proof bowl and place over the pot of simmering water. Stir constantly until chocolate has melted. Set aside.",
      "½ cup butter, 2/3 cup chopped white chocolate*",
      "Preheat oven to 350 degrees (180°C). Grease an 8×8-in baking dish.",
      "Batter: Add sugar to a mixing bowl. Add lemon zest and use your fingers to combine the two well. Add white chocolate mixture and mix well. Add eggs and lemon juice and mix well. Stir in flour and salt.",
      "¾ cup granulated sugar, 2 Tablespoons lemon zest, 2 large eggs, 1 egg yolk, 1 Tablespoon lemon juice, ¾ cup+ 1 Tablespoon all-purpose flour, ½ teaspoon kosher salt",
      "Bake: Pour into prepared pan and bake for 23-25 minutes. Allow to cool completely before glazing. (I think the brownie texture of them is even better the next day).",
      "Glaze: combine powdered sugar and 1 tablespoon fresh lemon juice. Stir well and add a little lemon juice at a time, as needed, until it reaches of soft glaze consistency.",
      "1 cup powdered sugar, 1-2 Tablespoons fresh lemon juice"
    ]
  },
  {
    "id": 124,
    "name": "Lentils flatbread",
    "type": "cook",
    "category": "Bread",
    "ingredients": [
      "1 cup red lentils",
      "Add water (about an inch above the lentils in a blender) - 2 cups of water",
      "Soak for at least 3 hours",
      "After the lentils have swollen, blend everything on high speed until very smooth",
      "Add a little salt",
      "Leave overnight in the fridge.",
      "Blend again for a second because it separates."
    ],
    "instructions": [
      "Heat a non stick small pan, oil sparingly with a paper towel and olive oil and gently cook each flatbread. Do not touch the batter too soon, before flipping, slide around the flatbread with a spatula, and flip only when you feel it’ll hold. After flipping, don’t touch for a minute (if you need to recenter)",
      "Generally, should be about 2 minutes on each side"
    ]
  },
  {
    "id": 125,
    "name": "Levivot (Latkes)",
    "type": "cook",
    "category": "Side",
    "ingredients": [],
    "instructions": []
  },
  {
    "id": 126,
    "name": "Mayland style baked crab cakes",
    "type": "cook",
    "category": "Side",
    "ingredients": [
      "1 large egg",
      "1/4 cup (60g) mayonnaise",
      "1 Tablespoon chopped fresh parsley (or 2 teaspoons dried)",
      "2 teaspoons Dijon mustard",
      "2 teaspoons Worcestershire sauce",
      "1 teaspoon Old Bay seasoning (up to 1 and 1/2 teaspoons for a spicier kick)",
      "1 teaspoon fresh lemon juice, plus more for serving",
      "1/8 teaspoon salt",
      "1 pound (454g) fresh lump crab meat*",
      "2/3 cup (41g) saltine cracker crumbs (about 17–18 2-inch crackers)",
      "optional: 2 Tablespoons (30g) melted salted or unsalted butter"
    ],
    "instructions": [
      "Whisk the egg, mayonnaise, parsley, Dijon mustard, Worcestershire sauce, Old Bay, lemon juice, and salt together in a large bowl. Place the crab meat on top, followed by the cracker crumbs. With a silicone spatula or large spoon, very gently and carefully fold together. You don’t want to break up that crab meat.",
      "Cover tightly and refrigerate for at least 30 minutes and up to 1 day.",
      "Preheat oven to 450°F (232°C). Generously grease a rimmed baking sheet with butter or nonstick spray, or line with parchment paper or a silicone baking mat.",
      "Using a 1/2 cup measuring cup, portion the crab cake mixture into 6 mounds on the baking sheet. (Don’t flatten!) Use your hands or a spoon to compact each individual mound so there aren’t any lumps sticking out or falling apart. For extra flavor, brush each top with melted butter. This is optional but recommended!",
      "Bake for 12–14 minutes or until lightly browned around the edges and on top. Drizzle each with fresh lemon juice and serve warm.",
      "Cover leftover crab cakes tightly and refrigerate for up to 5 days, or freeze for up to 3 months."
    ]
  },
  {
    "id": 127,
    "name": "Millionaire Shortbread",
    "type": "cook",
    "category": "Dessert",
    "ingredients": [
      "Shortbread Crust:",
      "1 ½ cups all-purpose flour",
      "½ cup butter, cut into small pieces",
      "3 tablespoons brown sugar",
      "Caramel:",
      "1 (14 ounce) can sweetened condensed milk",
      "4 tablespoons butter",
      "3 tablespoons brown sugar",
      "Topping:",
      "6 ounces milk chocolate, chopped"
    ],
    "instructions": [
      "Gather the ingredients. Preheat the oven to 375 degrees F (190 degrees C). Grease a 9-inch square pan.",
      "To make the shortbread crust: Sift flour into a bowl. Rub in butter with your fingertips until the mixture resembles fine bread crumbs. Mix in brown sugar and shape dough into a ball.",
      "Press dough into the prepared pan. Prick all over with a fork.",
      "Bake in the preheated oven until set and golden brown, about 18 to 20 minutes. Let cool.",
      "Meanwhile, to make the caramel: Combine condensed milk, butter, and brown sugar in a nonstick saucepan over medium-low heat. Cook, stirring constantly, until caramel comes to a boil. Reduce heat and cook until golden and pulling away from the sides of the pan, 5 to 10 minutes.",
      "Pour caramel over cooled crust and refrigerate until firm to the touch, about 1 hour.",
      "To make the chocolate topping: Place chocolate in top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes.",
      "Spread melted chocolate over cooled caramel. Refrigerate until chocolate hardens, about 15 minutes. Cut into bars."
    ]
  },
  {
    "id": 128,
    "name": "One Pot French Onion Pasta",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "3 tablespoons olive oil",
      "3 large yellow or white onions, thinly sliced",
      "1 ½ teaspoons salt, divided",
      "1 ½ teaspoons pepper, divided",
      "8 cloves fresh minced garlic",
      "1 tablespoon fresh minced thyme, or 1 ½ teaspoons dried thyme",
      "½ cup dry white wine, or sub extra broth",
      "1 tablespoon balsamic vinegar",
      "4 cups vegan beef broth or vegetable broth",
      "16 oz uncooked pasta",
      "1 cup vegan mozzarella shreds, at room temperature",
      "½ cup vegan heavy cream, at room temperature",
      "2 teaspoons Dijon mustard",
      "Garlicky breadcrumbs, for garnish, optional",
      "Vegan parmesan, for garnish, optional",
      "Fresh minced parsley, for garnish, optional"
    ],
    "instructions": [
      "Heat the oil in a large pot or Dutch oven over medium-high heat.",
      "Once the oil is hot, add the sliced onions, ½ teaspoon salt and ½ teaspoon pepper, stirring to combine.",
      "Reduce the heat to medium and continue to cook, stirring occasionally, until golden brown and jammy, 25 to 35 minutes. If you notice the onions starting to stick to the pan, add a splash of water or broth to deglaze.",
      "Stir in the garlic and thyme, and continue to cook until fragrant, 1 to 2 minutes.",
      "Add the wine and balsamic vinegar, scraping up any brown bits at the bottom of the pot.",
      "Pour in the broth and uncooked pasta and season with the remaining teaspoon of salt and pepper, stirring to combine.",
      "Increase the heat to high and bring to a boil.",
      "Once at a light boil, reduce the heat to low, cover, and simmer until the noodles are tender, stirring occasionally, 12 to 15 minutes.",
      "Remove the lid. Stir in the mozzarella, heavy cream, and Dijon mustard.",
      "Continue to mix until the mozzarella cheese has melted throughout and the sauce is creamy. Taste and adjust seasonings, if necessary.",
      "Garnish with vegan parmesan and fresh minced parsley and enjoy!"
    ]
  },
  {
    "id": 129,
    "name": "One Pot Pumpkin Mac and Cheese",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "12 ounces pasta, shape of choice",
      "3 tablespoons unsalted butter",
      "1 tablespoon minced garlic",
      "5 sage leaves",
      "2 sprigs thyme",
      "4 cups chicken broth",
      "1 cup pumpkin purée",
      "⅓ cup heavy cream",
      "1 teaspoon dry mustard powder",
      "¼ teaspoon onion powder",
      "1 teaspoon smoked paprika",
      "½ teaspoon salt, adjust to taste",
      "⅛ teaspoon nutmeg, more to taste",
      "dash of cayenne powder, to taste",
      "1 cup sharp cheddar cheese, shredded",
      "½ cup gouda, shredded",
      "½ cup colby jack, shredded",
      "parmesan cheese, grated (for garnish)",
      "black pepper, freshly cracked (for garnish)"
    ],
    "instructions": [
      "In a large pot over medium heat, melt the butter. Add the garlic, sage, and thyme and cook until fragrant, about 2 to 3 minutes. Remove the sage leaves and thyme sprigs and discard them.",
      "Still over medium heat, pour in the chicken broth and stir in the pumpkin purée and heavy cream until smooth. Season with mustard powder, onion powder, cayenne, smoked paprika, salt, and nutmeg.",
      "Raise the heat to medium-high, add the pasta, and bring the mixture to a boil. Reduce to a simmer and cook uncovered, stirring frequently, until the pasta is tender and most of the liquid has been absorbed, about 14 to 15 minutes.",
      "Lower the heat to the lowest setting, add the cheeses, and gently fold them in with a rubber spatula until completely melted into the sauce. Taste and adjust seasoning as needed.",
      "Serve hot, garnished with parmesan and freshly cracked black pepper."
    ]
  },
  {
    "id": 130,
    "name": "Peanut butter noodles",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "2 cups cooked noodles of your choice",
      "2 garlic cloves, crushed",
      "Neutral oil, for frying",
      "1 cup red pepper, chopped",
      "1 cup carrots, shredded",
      "1 cup edamame beans",
      "1 1/2 purple cabbage, shredded",
      "*SAUCE*",
      "1 cup ButtaNutt peanut butter",
      "1-2 tbsp sambal oelek (or chilli paste of your choice)",
      "1-2 tbsp lime juice",
      "1-2 tbsp soy sauce",
      "1-2 tbsp honey or agave",
      "salt and pepper",
      "hot water, to thin",
      "*TOPPINGS*",
      "salted chopped peanuts",
      "fresh coriander",
      "lime wedges"
    ],
    "instructions": [
      "Cook noodles according to package instructions.",
      "Heat oil in a pan, then saute garlic and ginger until fragrant.",
      "Stir in peanut butter, sambal oelek and hot water until smooth.",
      "Add soy sauce and honey/agave, then simmer gently.",
      "Toss in the noodles, coating them well, then add the vegetables and mix",
      "them through.",
      "Serve topped with cabbage, peanuts, coriander and lime."
    ]
  },
  {
    "id": 131,
    "name": "Pecan Pie Shortbread Cookie Bars",
    "type": "cook",
    "category": "Dessert",
    "ingredients": [
      "--- For Shortbread Layer: ---",
      "▢",
      "scant 1 ¼ cups / 150 g all-purpose flour",
      "▢",
      "½ cup / 100 g packed light brown sugar",
      "▢",
      "1 tablespoon / 8 g cornstarch",
      "▢",
      "¾ teaspoon fine sea salt",
      "▢",
      "½ cup / 113 g unsalted butter, cold, cut into cubes",
      "▢",
      "1 teaspoon vanilla extract",
      "--- For Pecan Topping: ---",
      "▢",
      "½ cup / 100 g packed light brown sugar",
      "▢",
      "¼ cup / 85 g light corn syrup",
      "▢",
      "¼ cup / 85 g maple syrup",
      "▢",
      "2 tablespoons / 30 g heavy cream",
      "▢",
      "¼ teaspoon fine sea salt",
      "▢",
      "1 teaspoon vanilla extract",
      "▢",
      "pinch cinnamon",
      "▢",
      "1 ½ cups / 170 g chopped pecans, lightly toasted"
    ],
    "instructions": [
      "Preheat oven to 350 degrees F. Line an 8-by-8-inch square baking pan with parchment paper or foil.",
      "Lightly toast the pecans first, spread on a baking sheet in the oven for 2 to 3 minutes or until fragrant (keep a close eye on them as they can burn quite easily).",
      "To prepare shortbread, combine flour, brown sugar, cornstarch and salt in a mixing bowl or the bowl of a stand mixer.",
      "Sprinkle over cubes of cold butter, then mix until the butter breaks up into lentil-sized pieces (finer than you would want for a pie crust). I find it helps to use my hands to almost smoosh and rub the bigger chunks of butter into the flour, then use the mixer to break it down further. Sprinkle over vanilla and mix to combine.",
      "The shortbread will appear very dry and crumbly, but should stick together when squeezed in your hand.",
      "Pour into prepared baking pan. Spread crumbs evenly over the bottom of the pan, then use our hand or a spatula to press the crumbs firmly into the pan, leaving a slightly raised border around the edges (this will help keep the filling in place).",
      "Bake shortbread for 20 to 25 minutes or until the top appears less shiny and the edges just barely start to turn golden brown.",
      "While shortbread is baking, prepare the filling by combining brown sugar, corn and maple syrups, cream, salt, and vanilla in a saucepan, stirring until sugar is evenly moistened. Set over medium heat and bring to a frothy boil, stirring regularly.",
      "Remove from head and stir in toasted chopped pecans, then pour over shortbread layer, spreading nuts out evenly.",
      "Bake for 18 to 22 minutes or until top is covered in small bubbles and no longer jiggles when you wiggle the pan.",
      "Remove from heat and let cool on a wire rack until lukewarm, then refrigerate for at least an hour to fully set the layers.",
      "Cut chilled bars into 16 squares. Serve cold or at room temperature as desired. Bars will keep, refrigerated in an airtight container, for up to 2 weeks, or frozen for up to 2 months."
    ]
  },
  {
    "id": 132,
    "name": "Persian Quince and meat stew",
    "type": "cook",
    "category": "Soup",
    "ingredients": [
      "1 pound (450 g) boneless leg of lamb, lamb shoulder, lamb shank, lamb neck, or boneless beef chuck roast, cut into 1 to 1 1/2-inch cubes",
      "1 teaspoon Diamond Crystal kosher salt; for table salt, use half as much by volume, divided",
      "1/2 teaspoon ground black pepper",
      "5 tablespoons (75 ml) olive oil and/or ghee, divided",
      "1 small yellow or red onion (about 4 ounces; 113 g), chopped",
      "1 teaspoon ground turmeric",
      "1 1/2 pounds (680 g) fresh quince",
      "3 tablespoons (about 50 g) tomato paste",
      "1 tablespoon (15 ml) fresh lime or lemon juice",
      "1 tablespoon (about 13 g) granulated sugar",
      "1/2 teaspoon ground cinnamon",
      "7 ounces (200 g) dried sour plums, pitted or whole (see notes)"
    ],
    "instructions": [
      "In a large bowl, combine meat with 1 teaspoon kosher salt and 1/2 teaspoon pepper. In a large Dutch oven or heavy-bottomed pot, heat 2 tablespoons of oil and/or ghee over medium-high heat until shimmering. Add meat in a single layer. Cook, turning occasionally until meat is well browned on all sides, about 10 minutes. With a slotted spoon, transfer meat to a plate and set aside (don't discard remaining fat in Dutch oven).",
      "Add 1 tablespoon oil and/or ghee to Dutch oven and heat over medium heat until shimmering. Add onion and cook, stirring occasionally, until softened and golden, about 7 minutes. Stir in turmeric and cook until fragrant, about 30 seconds.",
      "Add 2 cups of water and reserved meat. Bring to a boil over medium-high heat, stirring and scraping bottom of Dutch oven, until browned bits have come loose. Reduce heat to a simmer and cook, covered, over medium-low heat, until the braising liquid has slightly thickened and thin pools of fat are visible on the surface, about 55 minutes, adjusting heat as needed to maintain a simmer.",
      "Meanwhile, cut each quince into quarters vertically (do not peel quinces). Using a sharp chef's knife, carefully remove the core from each quarter. Cut each quarter into 1- to 1 1/2-inch pieces; set aside.",
      "In a large stainless steel skillet, heat 2 tablespoons of oil or ghee over medium heat until shimmering. Stir in tomato paste and cook, stirring often, until it darkens in color, about 3 minutes. Add reserved quince pieces and stir until evenly coated with tomato paste; set aside.",
      "After the meat has cooked for 55 minutes, add reserved quince and tomato paste mixture to Dutch oven. Stir in lime or lemon juice, sugar, and cinnamon. Bring to a simmer and cook, covered, until quince is slightly tender, for 20 minutes, stirring halfway through.",
      "Stir in plums. Cook, adjusting heat as needed to maintain a gentle simmer, and cook until quince is completely tender, 25 to 30 minutes, gently stirring every 10 minutes. Serve with rice."
    ]
  },
  {
    "id": 133,
    "name": "Pork Brine for tender meat",
    "type": "cook",
    "category": "Condiment",
    "ingredients": [
      "4 cups water",
      "3 tablespoons kosher salt",
      "3 tablespoons sugar",
      "1 Tablespoon white vinegar (a splash)",
      "4-5 pork chops"
    ],
    "instructions": [
      "In a medium-sized pot add water, kosher salt, sugar",
      "Bring to a simmer over high heat. You do not need the water to rapidly boil but you need to make sure the salt and sugar have dissolved in the water.",
      "Remove the pot from the heat and cool completely.",
      "Once the brine is cool add the pork chops to a bowl or a large ziptop bag and pour in the brine.",
      "Let the pork brine in the refrigerator for up to 2-4 hours. I marinated 24 - 48 hours",
      "Rinse and pat dry before cooking."
    ]
  },
  {
    "id": 134,
    "name": "Poulet Mafé",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "1 pound bone-in chicken thighs, skin removed",
      "1 pound chicken drumsticks, skin removed",
      "1 tablespoon peeled and finely chopped fresh ginger",
      "1 small yellow onion, chopped",
      "8 ounces green cabbage, cored and cut into 2-inch wedges",
      "3 medium carrots, cut into 2-inch-long pieces",
      "2 medium Yukon Gold potatoes, peeled and cut into 1 1/2 -inch pieces",
      "1 medium-size sweet potato, peeled and cut into 1 1/2 -inch pieces",
      "1 (6-ounce) can tomato paste",
      "1/4 cup fish sauce (such as Red Boat)",
      "1 cup unsweetened creamy peanut butter (such as Smucker's Natural Creamy Peanut...",
      "3 tablespoons vegetable oil",
      "3 medium garlic cloves, finely chopped",
      "Pinch of kosher salt, plus more to taste",
      "Pinch of black pepper",
      "7 cups water",
      "Sliced fresh Scotch bonnet chiles, to taste (optional)",
      "Cooked white rice, for serving"
    ],
    "instructions": [
      "Stir together garlic, ginger, salt, and black pepper in a large bowl. Add chicken; press garlic mixture into chicken pieces. Cover with plastic wrap; refrigerate at least 3 hours or up to 12 hours.",
      "Heat oil in a large Dutch oven over medium-high until oil shimmers. Add onion; cook, stirring often, until onion starts to become translucent, about 3 minutes. Stir in tomato paste and fish sauce. Cook, stirring constantly, until combined and tomato paste caramelizes and turns a few shades darker, 6 to 8 minutes. Add 7 cups water, scraping up any browned bits from bottom of Dutch oven. Add chicken and any remaining garlic mixture in bowl to Dutch oven. Bring to a boil over high. Reduce heat to medium-low.",
      "Place peanut butter in a medium-size heatproof bowl; stir in 1 1/2 cups liquid from Dutch oven, 1/4 cup at a time, until peanut butter is thinned out and mixture is creamy. Add to mixture in Dutch oven; bring to a vigorous simmer over medium-low. Simmer, undisturbed, 20 minutes.",
      "Stir cabbage and carrots into mixture in Dutch oven; return to a vigorous simmer over medium-low. Simmer, undisturbed, 10 minutes.",
      "Stir potato and sweet potato pieces into mixture in Dutch oven; return to a vigorous simmer over medium-low. Simmer, undisturbed, until chicken and vegetables are tender and oil has separated from thickened sauce, 30 to 35 minutes. Remove from heat; stir in Scotch bonnet chiles, if using, and season with salt to taste. Serve over rice."
    ]
  },
  {
    "id": 135,
    "name": "Rye and whole wheat bread",
    "type": "cook",
    "category": "Bread",
    "ingredients": [],
    "instructions": [
      "Sift the flours over a large bowl to separate out the bran from the finer white flour.",
      "In a smaller bowl, mix the bran with 130g of warm water. This hydrates the bran so it does not draw water out of the dough when mixed back in.",
      "Add the yeast and salt to the white flour and stir in.",
      "Add the hydrated bran back to the white flour, along with the remaining 130g of water. Mix well (no kneading), then leave to stand for 5-10 minutes.",
      "Prepare a small loaf tin (15 x 9 x 7 cm) by lightly oiling the inside surface. Scrape the wet dough into the loaf tin and level the surface with a spatula.",
      "Leave to rise for 1.5 to 3 hours, depending on room temperature. The dough is ready when it has expanded to the top of the loaf tin. NOTE: Start to preheat oven to Gas Mark 9 / 250°C when the dough has risen half-way from where it started.",
      "Bake at Gas Mark 9 / 250°C for 10 minutes, then turn down to Gas Mark 7 / 220°C for 25-35 more minutes. The loaf is ready when the top is mid-brown, and it sounds light and hollow when tapped on the base. Remove from tin and cool on a wire rack."
    ]
  },
  {
    "id": 136,
    "name": "Sticky coconut chicken and rice",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "Yield:4 servings",
      "1½pounds boneless, skinless chicken thighs, each thigh cut into 2 equal-size pieces",
      "¼cup neutral oil, such as safflower or canola",
      "2teaspoons kosher salt (Diamond Crystal)",
      "½teaspoon black pepper",
      "2tablespoons minced fresh ginger",
      "1tablespoon minced garlic",
      "1½cups short-grain white rice, rinsed until water runs clear",
      "1¾cups low-sodium chicken broth",
      "1(13.5-ounce) can full-fat coconut milk",
      "1yellow bell pepper, cored, seeded and chopped (½-inch pieces)",
      "½cup roasted cashews, coarsely chopped",
      "3scallions, green and white parts, thinly sliced (½ packed cup)",
      "2tablespoons coarsely chopped cilantro",
      "Hot sauce, for serving"
    ],
    "instructions": [
      "Step 1",
      "Heat oven to 375 degrees. Rub chicken with 1 tablespoon of oil, and season with 1 teaspoon of salt and ¼ teaspoon of pepper.",
      "Step 2",
      "In a large Dutch oven, heat 2 tablespoons of the oil over medium. Working in two batches, brown chicken, turning halfway, until no longer pink, around 5 minutes per batch. Transfer to a plate.",
      "Step 3",
      "Add the remaining 1 tablespoon oil, the ginger and the garlic to the empty pot, and stir until fragrant, 30 seconds. Add rice and stir until evenly coated in the oil. Add broth, coconut milk, bell pepper, cashews, scallions and the remaining 1 teaspoon salt and ¼ teaspoon pepper. Stir to lift up any browned bits on the bottom of the pot. Arrange chicken on top, add any accumulated juices from the plate and bring to a boil over high.",
      "Step 4",
      "Cover and bake until all of the liquid is absorbed, rice is tender and chicken is cooked through, 25 minutes. Scatter cilantro over the chicken and rice, then divide among bowls. Serve with hot sauce."
    ]
  },
  {
    "id": 137,
    "name": "Stuffed Eggplants",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "Eggplant Stuffed With Rice and Tomatoes"
    ],
    "instructions": [
      "The filling for these irresistible stuffed eggplants is also good for peppers and squash. Substitute the chopped flesh of the summer squash for the eggplant, and just use the rice and tomatoes for peppers. Make these a day ahead for best results.",
      "2 1/2 to 3 pounds small or medium eggplants",
      "Salt to taste",
      "1 1/2 pounds tomatoes, grated on the large holes of a box grater",
      "3 tablespoons extra virgin olive oil",
      "4 to 6 garlic cloves (to taste), minced",
      "1/2 cup uncooked long-grain or basmati rice",
      "1/2 cup finely chopped cilantro",
      "3 tablespoons finely chopped mint",
      "Freshly ground pepper to taste",
      "Juice of 2 lemons",
      "1/2 teaspoon ground allspice",
      "1/2 teaspoon ground cinnamon",
      "1/4 teaspoon sugar",
      "3 tablespoons tomato paste",
      "1. Cut the eggplants in half. With a grapefruit spoon or a small knife, remove the flesh to within 1/2 inch of the skins.",
      "2. Sprinkle the eggplant shells with salt, and let sit for 30 minutes while you prepare the remaining ingredients. Chop the flesh, and steam for 20 minutes, until tender.",
      "3. In a large bowl, combine a third of the tomatoes, the steamed eggplant, 2 tablespoons of the olive oil, all but 1 clove of the garlic, the rice, herbs and the juice of one of the lemons. Season with salt and pepper.",
      "4. Oil a large flameproof casserole or an earthenware casserole set over a flame tamer. Combine the remaining tomatoes, olive oil, allspice, cinnamon, lemon juice, sugar, tomato paste and remaining garlic in the casserole. Season to taste with salt and pepper. Fill the eggplant shells with the rice mixture, and arrange in the casserole in a single layer. Add water if necessary to cover about a third of the eggplant. Bring to a simmer over medium-high heat, cover tightly and reduce the heat to low. Simmer 45 minutes to an hour until the eggplant and rice are tender. Remove from the heat.",
      "5. Using two spatulas (the eggplants are soft at this point), transfer the eggplants to a platter. Bring the sauce to a boil. If it is not already thick, reduce until thick and fragrant. Pour over the eggplants, and allow to cool to warm or room temperature. They’re good chilled as well. Garnish with chopped fresh parsley or cilantro if desired.",
      "Yield: Serves six.",
      "Advance preparation: These taste even better the day after they’re made; they firm up in the refrigerator and are easier to handle. They will keep for about four days in the refrigerator. I like them cold.",
      "Nutritional information per serving: 193 calories; 1 gram saturated fat; 1 gram polyunsaturated fat; 5 grams monounsaturated fat; 0 mg cholesterol; 30 grams carbohydrates; 6 grams dietary fiber; 32 milligrams sodium (does not include salt to taste); 4 grams protein",
      "Martha Rose Shulman is the author of \"The Very Best of Recipes for Health.\""
    ]
  },
  {
    "id": 138,
    "name": "Tepache - pineapple peels healthy drink",
    "type": "cook",
    "category": "Drink",
    "ingredients": [
      "1 ripe pineapple",
      "6 ounces of unrefined sugar, traditional is piloncillo, but any dark sugar will work",
      "1 soft cinnamon stick",
      "1 star anise pod",
      "3-4 cloves or cinnamon buds",
      "1 mace blade",
      "6 allspice berries",
      "Good water"
    ],
    "instructions": [
      "Remove the greens from the pineapple (these can be used as drink garnishes if they are in good shape) then thoroughly wash the fruit to remove any dirt.",
      "In a small saucepan dissolve the sugar in a couple cups of water.",
      "Peel the pineapple and transfer the peels and core to a jar or crock. I personally like to use bail top jars for fermenting because the design lets any built up pressure naturally release, but still keeps a good seal. Reserve the fruit for another use, like my crispy pork shoulder.",
      "Add the spices to the pineapple, pour the sugar syrup over, then add more water to cover, about 10 more cups.",
      "Seal the jar, or cover whatever other container you are using, and allow to ferment. It will go faster or slower depending on the temperature of the room, you'll know it's working because you will see bubbles and foam at the top. Taste after 2 days, it should be tart and balanced, if not, give it another day. When it's to your liking, filter out the solids.",
      "You can enjoy it right away, room temp or chilled. If you'd like to naturally carbonate it, add the tepache to bottles that can withstand pressure (soda bottles are perfect), squeeze out any extra air, seal, then let sit at room temperature for a couple days before refrigerating. It will keep for at least a couple week in the fridge.",
      "Feel free also to sweeten to your tastes, it's a naturally low sugar drink as most of the sugar is fermented out.",
      "• You can continue the fermentation, adding an additional 6 ounces of sugar at the two day mark, and you will end up with a tasty vinegar after about a week. I love using it in salad dressings, marinades, and as a beverage mixed with seltzer."
    ]
  },
  {
    "id": 139,
    "name": "Thai Glass Noodle Soup",
    "type": "cook",
    "category": "Soup",
    "ingredients": [
      "5 cups water, see note 1",
      "¼-½  the amount of bouillon for the amount of water",
      "1 tablespoon fish sauce",
      "1 tablespoon soy sauce",
      "½ teaspoon sugar (I used more)",
      "1.4 oz dried glass noodles",
      "250 g egg tofu, or soft tofu",
      "4 cups bok choy or napa cabbage, bite-sized pieces",
      "Oyster mushrooms without the tough base",
      "green onions",
      "--- Pork Meatballs ---",
      "½ lb ground pork or chicken, preferably not lean",
      "2 teaspoons soy sauce",
      "1 teaspoon fish sauce",
      "¾ teaspoon sugar"
    ],
    "instructions": [
      "Boil water (I used more water and adjusted seasoning by eye.",
      "When the water boils, add bouillon, soy, sugar, and fish sauce.",
      "Meanwhile soak the glass noodles in room temp water for at least 7 minutes to soften, then drain and cut into 2-3 sections.",
      "Make the meatballs by combining all ingredients together and use your hand to knead the mixture until well combined. Att to the boiling soup with the help of two teaspoons.",
      "After the meatballs are all added, allow the soup to come back to a boil if it has stopped, and then add the bok choy, the mushrooms and sliced egg tofu, then wait for the soup to come back to a boil. Then add the glass noodles",
      "Taste and adjust seasoning with more soy sauce or fish sauce or sugar, as needed, then finish it off with green onions"
    ]
  },
  {
    "id": 140,
    "name": "Turkish Salad Israeli style",
    "type": "cook",
    "category": "Soup",
    "ingredients": [
      "(makes about 4 tall plastic soup containers)",
      "For 1.5 the quantity use amount in parenthesis ()",
      "2 (3) large regular (Spanish) onions, chopped to 1/4″ pieces",
      "4 (6)  red bell peppers finely chopped or grated",
      ".          16 (24) cloves garlic - crushed",
      "4 (6) tbsp olive oil",
      "2 (3) can tomato sauce",
      ".          4 (6) cans tomato paste",
      "4 (6) Tbs cumin",
      ".          2 (3)  Tbs sugar",
      "1 (1.5) Tbs salt",
      "2 (3) bunches chopped parsley",
      "2 (3) large sweet onion,  copped small",
      "1.5 (2.75) Tbsp garlic chili paste (rooster)"
    ],
    "instructions": [
      "Heat oil on medium flame, add onion, red bell pepper. and garlic. saute until onion start to become translucent, 4-5 minutes",
      "Add  tomato sauce, tomato paste, hot paste, and all spices. Saute while mixing from time to time for 10 minutes",
      "Add parsley and sweet onion, turn off the flame, mix and let cool down",
      "Enjoy"
    ]
  },
  {
    "id": 141,
    "name": "Turmeric Rice with Chickpeas (_)",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "▢",
      "2 tablespoons extra virgin olive oil",
      "▢",
      "1 leek chopped – or a large onion",
      "▢",
      "3 cloves garlic grated",
      "▢",
      "1 teaspoon turmeric",
      "▢",
      "1 teaspoon dried oregano",
      "▢",
      "5 cups spinach about 5 cups / chopped",
      "▢",
      "½ cup basmati rice or jasmine rice — uncooked",
      "▢",
      "2 cans chickpeas 15 oz / 400 g each can — drained and rinsed — or 3 cups / 460 g cooked chickpeas",
      "▢",
      "3 cups vegetable broth add more to taste if you like a brothier dish - I added water, and after they boiled, added bouillon powder",
      "▢",
      "½ teaspoon salt or more to taste + black pepper to taste",
      "▢",
      "1 lemon the juice (didn’t use)",
      "▢",
      "4 dollops Greek yogurt (didn’t add)"
    ],
    "instructions": [
      "Sauté the Leek: Heat 2 tablespoons extra virgin olive oil in a large skillet or saucepan over medium heat. Add 1 leek (sliced) and cook for about 4 minutes, until soft and translucent.",
      "Tip: Leek can be sandy. Slice it in half lengthwise, rinse well between the layers, shake off water, and slice thinly before cooking.",
      "Add Flavor and Greens: Stir in 3 cloves garlic (grated), 1 teaspoon turmeric, 1 teaspoon dried oregano, and 5 cups spinach (chopped). Season with ½ teaspoon salt and pepper. Cook for 2–3 minutes, until the spinach wilts and everything smells delicious.",
      "Add Rice and Chickpeas: Add ½ cup basmati rice and 2 cans chickpeas, stirring to coat them in the spices. Pour in 3 cups vegetable broth, bring to a boil, then reduce heat and simmer for about 15 minutes, stirring occasionally, until the rice is tender.",
      "Tip: No need to rinse supermarket rice — it’s clean and the starch helps make the dish naturally creamy.",
      "Finish and Serve: Taste and adjust seasoning. Serve warm with lemon juice and a dollop of Greek yogurt or Skyr. For extra protein, top with a poached egg."
    ]
  },
  {
    "id": 142,
    "name": "beets,carrots, and apples salad",
    "type": "cook",
    "category": "Salad",
    "ingredients": [
      "1 large beet, microwaved for 3-4 minutes",
      "2-3 carrots",
      "1 large fuji apple (unpeeled)",
      "(the cut portions should be roughly the same for all three ingredients)",
      "Peel beet and carrots."
    ],
    "instructions": [
      "Cut everything into matchsticks (i used magimix attachment) (maybe grating would work - I haven't tried)",
      "Drizzle a little avocado oil (or other flavorless oil)",
      "Add white vinegar gradually and a little salt.(perhaps a little sugar)",
      "Mix well, taste and adjust flavors."
    ]
  },
  {
    "id": 143,
    "name": "chicken thighs with bulgur",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "4-6 thighs (or drumsticks)",
      "1.5 cup coarse bulgur",
      "½ cup cashews",
      "½ cup craisins or currants",
      "1 large onion finely chopped",
      "4 garlic cloves, finely chopped",
      "Water - enough to cover the bulgur",
      "For the marinade:",
      "¼ cup olive oil",
      "3 Tbs silan (date syrup/honey)",
      "3 Tbs soy sauce",
      "½ Tbs Baharat spice",
      "½ tsp cinnamon",
      "1 tsp turmeric",
      "½ Tbs sweet paprika (or hot if you prefer)",
      "Salt",
      "1 cup water"
    ],
    "instructions": [
      "Pre-heat oven to 400F",
      "2. In a large bowl, mix all marinade ingredients and add the thighs, make sure they are well covered.",
      "In another bowl, mix the bulgur, cashews, craisins, onion, and garlic.",
      "Transfer to a well oiled baking pan",
      "5. Cover with water (about 2 cups)",
      "Place the meat on the bulgur in the pan, (pressing down into the bulgur a little)",
      "Pour the marinade onto the ingredients in the pan",
      "Cover in aluminum foil and bake for 40 minutes",
      "Take off the aluminum foil, stir the bulgur gently, and return to the oven for additional 10 minutes.",
      ". check the thighs for doneness."
    ]
  },
  {
    "id": 144,
    "name": "crispy lentil salad",
    "type": "cook",
    "category": "Salad",
    "ingredients": [
      "200 g red lentils",
      "spices (curry, for example)",
      "soy sauce",
      "20 pitted olives",
      "2 bell peppers (one red and one yellow)",
      "250 g cherry tomatoes",
      "1 cucumber",
      "parsley",
      "mint",
      "1 scallion",
      "--- For the dressing: ---",
      "4 tbsp sesame paste (tahini)",
      "juice of 1/2 lemon",
      "1 tbsp soy sauce",
      "1 tbsp apple cider vinegar",
      "1/2 tsp turmeric"
    ],
    "instructions": [
      "Rinse the lentils, drain them, then place them in a saucepan with 500 ml of salted boiling water. Bring to a boil, then turn off the heat. Leave to rest, covered, for about 10 minutes. The lentils should still hold their shape!",
      "Drain them well, then mix with 1 tbsp olive oil, 1 level tsp of spices, and 1 tbsp soy sauce. Spread them on a baking tray lined with parchment paper, forming a flat layer.",
      "Bake for 30 minutes in a preheated oven at 180°C (350°F), stirring halfway through.",
      "Chop all the vegetables. Prepare the sesame dressing by mixing all the ingredients with a little boiling water (start with 100 ml, then add gradually until you get a creamy texture).",
      "All that’s left is to bring out your nicest salad bowl, toss in the crispy lentils, dressing, and fresh veggies. A truly original, flavorful recipe that will quickly make you forget the school cafeteria trauma of your teenage years!"
    ]
  },
  {
    "id": 145,
    "name": "mild white kimchi",
    "type": "cook",
    "category": "Condiment",
    "ingredients": [
      "--- Brine ---",
      "1 head Napa cabbage 1kg (about 2.2 lbs)",
      "2 cups Water",
      "½ cup Coarse sea salt (kosher salt) (about 100g)",
      "--- Seasoning ---",
      "Flour slurry (1 tbsp all-purpose flour + ¾ cup water) Substitute: 1½ tbsp glutinous rice flour or rice flour",
      "200 g Korean radish (or kohlrabi) 1¾ cups when cut into matchsticks",
      "20 g Carrot ¼ cup when cut into thin matchsticks",
      "1 stalk Green onion",
      "½ Red chili pepper optional to add heat",
      "1 tbsp Coarse sea salt (or kosher salt)",
      "--- Broth ---",
      "½ Asian pear or red apple about 100g",
      "¼ Onion about 50g",
      "2 cloves Garlic about ⅔ tbsp minced",
      "1 thin slice Ginger about ½ tsp minced",
      "1 tsp Coarse sea salt"
    ],
    "instructions": [
      "Cut the napa cabbage into quarters, then slice crosswise into bite-sized pieces.",
      "pro-tip #1: Don’t throw away the cabbage core. Thinly slice it and use it for kimchi as well. It gives a good crunchy bite!",
      "Dissolve ½ cup coarse sea salt in 2 cups of water, then pour it over the cabbage. Toss gently to coat.",
      "Weigh it down with a plate & something heavy (like a pot, mortar, etc.) and flip every 30 minutes. Let it brine for 1.5 hours in summer, up to 3 hours in winter. The thick white stem of the cabbage should bend easily without snapping.",
      "Rinse the cabbage 3 times, changing the water each time, then drain in a colander for 10 minutes.",
      "Make the Flour Slurry: In a pan, combine 1 tbsp flour and ¾ cup water to make a flour slurry. Whisk until smooth and bring to a boil while stirring continuously. Simmer for 1–2 minutes, then let cool completely.",
      "Cut Korean radish (or kohlrabi) into matchsticks.",
      "Cut carrot into thin matchsticks.",
      "Thinly slice green onion diagonally.",
      "To add gentle heat without overpowering, halve the red chili pepper lengthwise, scrape out the seeds and thinly slice.",
      "Make the Dashima water (kelp water) by Soaking a piece of dried kelp in 400ml cold water for 5 hours, or steep in hot water for 10 minutes, then cool. Take out the kelp.",
      "Cut Asian pear (or peeled red apple), onion in to cubes. Crush the garlic and slice a little ginger. Blend everything with 1 tsp salt and 1¾ cups (350ml) dashima water until smooth.",
      "In a large bowl, mix the blended ingredients with the flour slurry, julienned radish (or kohlrabi), carrot, sliced green onion, optional chili pepper, and 1 tbsp salt.Toss until everything is evenly coated.",
      "Gently mix the drained cabbage with the seasoning paste, ensuring every piece is coated.",
      "Pro-tip #2: Mix gently. Don’t mash! Keeping the crunch is key.",
      "Pack the kimchi tightly into a clean 2-liter container or jar.",
      "Pour the broth over the packed kimchi, pressing down gently to ensure the cabbage is fully submerged. If available, place a fermentation weight on top.",
      "Let it sit at room temperature for 1–2 days (just half a day in summer). You’ll know it’s ready to refrigerate when you see small bubbles forming and a slight tanginess in taste.",
      "Transfer to the refrigerator, where it will slowly develop deeper, complex flavors.",
      "Although some kimchi can be enjoyed immediately, I recommend waiting at least 5 to 7 days for white kimchi. It develops a much deeper, more harmonious flavor after this time.Try it at different stages—fresh, tangy, or deeply fermented!My favorite stage? After around 2-3 weeks."
    ]
  },
  {
    "id": 146,
    "name": "pineapple chutney",
    "type": "cook",
    "category": "Condiment",
    "ingredients": [
      "2 tbsp sunflower oil [I used Avocado oi]",
      "3 red onions finely chopped [I used regular frozen chopped onions]",
      "1 tbsp yellow mustard seeds",
      "1 tbsp black onion [didn’t use]",
      "seeds (kalonji or nigella) [I used Nigella]",
      "1 tsp turmeric",
      "2 pineapples - peeled, cored and chopped into small chunks",
      "1 red chilli deseeded and finely chopped [didn’t use]",
      "thumb-sized piece ginger finely chopped",
      "250g soft light brown sugar [i used white]",
      "175ml cider vinegar [i used white vinegar]"
    ],
    "instructions": [
      "step 1",
      "Heat the oil in a large heavy-based pan. Tip in the onions and spices and cook for 5 mins until fragrant. add the rest of the ingredients plus 1 tsp salt and simmer for 1 hr until dark golden and thick. Pour into sterilised jars and allow to cool before covering.",
      "To sterilise jars, wash in hot soapy water, rinse well and dry in the oven at 180C/160 fan/ gas 4 for 10 mins just before filling. Once stored in sterilised jars, this chutney will keep for up to 1 year."
    ]
  },
  {
    "id": 147,
    "name": "sauerkraut",
    "type": "cook",
    "category": "Condiment",
    "ingredients": [],
    "instructions": [
      "Cut the cabbage in half lengthwise and remove the core. Cut each half in half, then slice thinly as for coleslaw. Put the cabbage in a very large bowl along with the shredded carrot and beet.",
      "Sprinkle the salt over the vegetables and, with clean hands, begin mixing and massaging it together until the cabbage is very limp and reduced by half. Mix in the caraway seeds if using.",
      "Divide the cabbage and the liquid in the bowl among the jars. Use a wooden spoon to pack the cabbage down until the liquid covers the leaves. Press and pack the cabbage down every few hours making sure it’s covered with the liquid. Loosely cover the jars. Once fermentation begins, the volume of the cabbage will increase in the jars. If the cabbage is not fully submerged, top it off with a brine mixture: 1 1/2 teaspoons of kosher salt in 1 cup of water. (The cabbage needs to be fully submerged to ferment properly.)",
      "Set the jars at room temperature in a dark spot with the lids on but not screwed down tightly. Let them sit for about five days and up to two weeks.",
      "Taste! It should be tangy, briny, crunchy when ready then crew on the lids and refrigerate for up to four months.",
      "Beth’s Notes:",
      "You don’t need tons of cabbages or a big crock to make a good sauerkraut. All it takes is a bit of dicing and time. Making sauerkraut is simple: shredded cabbage is mixed with coarse salt and stored in a ventilated jar. Give it a week for the natural bacteria to convert the cabbages sugars into lactic acid. This gives the kraut its funk and pop.",
      "The longer the kraut ferments, the stronger the flavor will be. Vary the all-cabbage sauerkraut by adding shredded beets, carrots and/or parsnips for color and taste. Delicious with brats, pork and game, it jazzes up sandwiches and flatbreads, and it works beautifully on a cheese tray."
    ]
  },
  {
    "id": 148,
    "name": "spelt bread",
    "type": "cook",
    "category": "Bread",
    "ingredients": [
      "Metric",
      "5 g dried yeast (or 10g fresh)",
      "300 ml tepid water",
      "250 g wholemeal spelt flour",
      "250 g strong white bread flour, plus extra for dusting",
      "10 g fine-grain sea salt"
    ],
    "instructions": [
      "Mix the yeast and tepid water until the yeast has dissolved. Combine the flours in a bowl, add the dissolved yeast and the salt, and bring together into a raggedy dough. Tip it out on to the work surface and knead vigorously for 15 minutes to make a soft, stretchy dough. Your dough will now be elastic, but not so elastic as regular wheat dough. Transfer to a bowl and cover it. Allow to prove until doubled in size (no more than 1 hour), in a warm place.",
      "Grease a large (2lb) loaf tin. Once the dough is proved, shape it into a firm ball between cupped hands, then place it on the work surface and gently roll with the flat of your hands until it is the length of the tin. Place it in the tin, cover and leave to prove for a further hour or until doubled in size.",
      "Heat the oven to 230°C/Gas 8. If you have one, put a baking stone into the oven to heat up at the same time.",
      "Sprinkle the loaf with spelt flour and sea salt and transfer to the hot oven (to the stone, if using). Spray the oven with water spray and close the door to create a crust. Bake for 30 minutes. Remove the loaf from the oven, take out of the tin and leave to cool completely."
    ]
  },
  {
    "id": 149,
    "name": "walnut and pomegranate chicken",
    "type": "cook",
    "category": "Main",
    "ingredients": [
      "2 cups shelled walnut halves and pieces",
      "1 tablespoon + 1 teaspoon kosher salt",
      "2 teaspoon freshly ground black pepper",
      "2 teaspoon ground cumin",
      "2 teaspoon ground turmeric",
      "2 lbs chicken thighs and drumsticks about 8 pieces",
      "1 tablespoon balsamic vinegar",
      "Juice of 1 lemon",
      "4 cloves garlic finely grated",
      "½ cup pomegranate molasses",
      "½ cup pomegranate juice",
      "¼ cup honey",
      "3 tablespoon canola oil",
      "Pinch of saffron threads optional"
    ],
    "instructions": [
      "Preheat the oven to 350°F. Toast walnuts on a baking sheet for 8-10 minutes. Set aside.",
      "Mix salt, pepper, cumin, and turmeric in a small bowl. Season chicken with the spice mix.",
      "Heat a large pot or Dutch oven over medium-high heat. Add oil and brown chicken in 2-3 batches, about 10 minutes per batch. Transfer to a bowl.",
      "Remove the pot from heat and let oil cool. Wipe out burnt spices.",
      "Place chicken and toasted walnuts back in the pot.",
      "In a separate bowl, whisk together olive oil, pomegranate molasses, pomegranate juice, honey, balsamic vinegar, lemon juice, and garlic. Add saffron threads if desired.",
      "Place chicken skin side up in a roasting dish. Pour the marinade over the chicken.",
      "Bake until chicken reaches 165°F (about 25 minutes for breasts, 45 minutes for thighs). Remove breasts if using both light and dark meat.",
      "Increase the oven to 450°F. Let the sauce reduce and the skin get crispy for about 12 minutes. Brush chicken with the pan's marinade every 3-4 minutes.",
      "Serve warm, garnish with pomegranate seeds and parsley.",
      "Store leftovers in the fridge for up to 3 days."
    ]
  }
]